---
kind: property
id: P:Autodesk.Revit.DB.GeometryElement.MaterialElement
source: html/4cbdd815-d02b-36a2-ef56-87b2138bb148.htm
---
# Autodesk.Revit.DB.GeometryElement.MaterialElement Property

Element describing the material from which this element is composed.

## Syntax (C#)
```csharp
public Material MaterialElement { get; }
```